# Data Analysis with Pandas
## Data Cleaning and Preparation

### Handling Missing Data

For numeric data, pandas uses the floating-point
value NaN (Not a Number) to represent missing data

In [7]:
import pandas as pd

from numpy import nan as NA

data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], 
                     [NA, NA, NA], [NA, 6.5, 3.]], 
                    columns = list('abc'))
print(data)
cleaned = data.dropna(how='all')

print() # blank line
print(cleaned)

#Passing how='all' will only drop rows that are all NA:
data.dropna(how='all')

# dropping columns that have all null values
data.dropna(axis=1, how='all')

     a    b    c
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

     a    b    c
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

     a    b    c
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [19]:
#filling of data
df = pd.DataFrame(np.random.randn(7, 3))
#print(df)
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA
print(df)
#Calling fillna with a dict, you can use a different fill value for each column:
#df.fillna(1.5)

# column number 1 will be filled with 0.5
# column number 2 will be fileld with 0
df.fillna({1: 0.5, 2: 0})

# fill  not values from left column (axis=0 means from top row)
df.fillna(method='ffill', axis = 1)
df.fillna(method='ffill', limit=1, axis=1)

          0         1         2
0  0.626152       NaN       NaN
1  0.421648       NaN       NaN
2 -1.565282       NaN -1.725883
3  0.043815       NaN  0.448622
4 -0.215372 -0.349134 -1.364444
5 -0.217726  0.985839 -0.958972
6  1.162426 -0.440026 -0.615778

          0         1         2
0  0.626152  0.626152       NaN
1  0.421648  0.421648       NaN
2 -1.565282 -1.565282 -1.725883
3  0.043815  0.043815  0.448622
4 -0.215372 -0.349134 -1.364444
5 -0.217726  0.985839 -0.958972
6  1.162426 -0.440026 -0.615778

### Removing Duplicates

In [29]:
import pandas as pd

data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],
                     'k2': [1, 1, 2, 3, 3, 4, 4]} )
#data.duplicated()
#data.drop_duplicates()
#
data['v1'] = ['one', 'two', 'one', 'four', 'one', 'six', 'two']
print(data)
data = data.drop_duplicates(['k1', 'v1'])
data

    k1  k2    v1
0  one   1   one
1  two   1   two
2  one   2   one
3  two   3  four
4  one   3   one
5  two   4   six
6  two   4   two

    k1  k2    v1
0  one   1   one
1  two   1   two
3  two   3  four
5  two   4   six

### Replacing Values

In [34]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.randn(7, 3))

df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
print(df)
df = df.replace(np.nan , -999)
print(df)
df = df.replace(-999 , -9)
#df =df.replace([-999, -9], [np.nan, 0])
print(df)

          0         1         2
0 -0.867764       NaN       NaN
1 -0.512635       NaN       NaN
2  1.105751       NaN  0.068817
3 -0.404658       NaN -0.888369
4 -0.694579 -1.218911  0.303929
5  0.037309  0.328864  0.188642
6 -0.538688  2.290389 -0.790317
          0           1           2
0 -0.867764 -999.000000 -999.000000
1 -0.512635 -999.000000 -999.000000
2  1.105751 -999.000000    0.068817
3 -0.404658 -999.000000   -0.888369
4 -0.694579   -1.218911    0.303929
5  0.037309    0.328864    0.188642
6 -0.538688    2.290389   -0.790317
          0         1         2
0 -0.867764 -9.000000 -9.000000
1 -0.512635 -9.000000 -9.000000
2  1.105751 -9.000000  0.068817
3 -0.404658 -9.000000 -0.888369
4 -0.694579 -1.218911  0.303929
5  0.037309  0.328864  0.188642
6 -0.538688  2.290389 -0.790317

In [ ]:
### Renaming Axis Indexes using function mapping

In [36]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
        index=['Ohio', 'Colorado', 'New York'],
        columns=['one', 'two', 'three', 'four'])

print(data)
transform = lambda x: x[:4].upper()
data.index.map(transform)

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

Index(['OHIO', 'COLO', 'NEW '], dtype='object')


### Detecting and Filtering Outliers

In [58]:
data = pd.DataFrame(np.random.randn(1000, 4))
data.describe()
col = data[2]
#print(col)
col[np.abs(col) > 3]
#To select all rows having a value exceeding 3 or –3, 
#you can use the any method on a boolean DataFrame:
outliers = data[(np.abs(data) > 3).any(1)]
print(len(outliers), len(data))
outliers
# check the difference
#print(data)
#data[(np.abs(data) > 3)]

7 1000

            0         1         2         3
150  0.893416  0.564380  3.405609  0.783080
314  0.561794  0.346520 -3.265676 -0.455322
326  0.982041 -3.448475  0.633005  0.162080
515  1.978378 -3.058335  2.555442 -0.158912
614  1.352738  2.529031 -3.350236 -0.592905
639 -3.433176 -0.857646 -0.864893  0.351802
901 -0.073349 -0.466439  3.181292  0.439371

### Permutation and Random Sampling

In [ ]:
# Permuting (randomly reordering)
# a Series or the rows in a DataFrame
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
print( df.shape )
sampler = np.random.permutation(5)
#data[sampler]
#print(sampler)
print(df)
df.take(sampler)

### Regular Expressions

When you call re.split('\s+', text) , the regular expression is first compiled, and
then its split method is called on the passed text. You can compile the regex yourself
with re.compile , forming a reusable regex object:

In [2]:
import re
text = "foo    bar\t baz \tqux"
#normal split = text.spli()
re.split('\s+', text)
['foo', 'bar', 'baz', 'qux']
# compile once to use again and again and save time
rgx = re.compile('\s+')
rgx.split(text)

['foo', 'bar', 'baz', 'qux']

### Vectorized String Functions in pandas

In [4]:
import re
import pandas as pd
import numpy as np
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
'Rob': 'rob@gmail.com', 'Wes': np.nan}
data = ["simpleEmail@email.com",   "simple.email@email.com",  
        "plus+symbol@email.com",   "dash-symbol@email.com",  
     "q@email.com",   
    "“unusual”@email.com",   "dash-symbol@email-dash.com",   "test@emailServer",  
  "” “@email.com",   "user@[IPv6:2001:DB8::1]",   
  "example@localhost",   "example@s.solutions",   
  "12345@email.com"]   

data = pd.Series(data)
pattern = '([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'
#data.str.findall(pattern, flags=re.IGNORECASE)
matches = data[data.str.match(pattern, flags=re.IGNORECASE)]
matches

0          simpleEmail@email.com
1         simple.email@email.com
2          plus+symbol@email.com
3          dash-symbol@email.com
4                    q@email.com
6     dash-symbol@email-dash.com
11           example@s.solutions
12               12345@email.com
dtype: object